# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [16]:
first = pd.Series(np.random.randint(1,4, size=100))
second = pd.Series(np.random.randint(1,3, size=100))
third = pd.Series(np.random.randint(10000,30000, size=100))

In [17]:
first

0     2
1     3
2     2
3     1
4     1
     ..
95    3
96    2
97    3
98    2
99    1
Length: 100, dtype: int32

In [18]:
second

0     2
1     2
2     1
3     1
4     2
     ..
95    1
96    2
97    2
98    1
99    1
Length: 100, dtype: int32

In [19]:
third

0     15378
1     13245
2     24949
3     19247
4     12828
      ...
95    11689
96    15194
97    16944
98    15916
99    10105
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [29]:
df = pd.concat([first, second, third], axis=1)
df

    0  1      2
0   2  2  15378
1   3  2  13245
2   2  1  24949
3   1  1  19247
4   1  2  12828
.. .. ..    ...
95  3  1  11689
96  2  2  15194
97  3  2  16944
98  2  1  15916
99  1  1  10105

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [31]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       2            15378
1       3       2            13245
2       2       1            24949
3       1       1            19247
4       1       2            12828
..    ...     ...              ...
95      3       1            11689
96      2       2            15194
97      3       2            16944
98      2       1            15916
99      1       1            10105

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [39]:
bigcolumn = pd.concat([first, second, third] , axis=0)
bigcolumn = pd.DataFrame(bigcolumn , columns=['bigcolumn'])
bigcolumn

    bigcolumn
0           2
1           3
2           2
3           1
4           1
..        ...
95      11689
96      15194
97      16944
98      15916
99      10105

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [40]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [62]:
bigcolumn.reset_index(drop=True , inplace=True)

In [63]:
bigcolumn

     bigcolumn
0            2
1            3
2            2
3            1
4            1
..         ...
295      11689
296      15194
297      16944
298      15916
299      10105

[300 rows x 1 columns]